/* MVP租用道具設定 */
// 普通道具
var itemList = [
    // [道具ID], [租用價格], [租用貨幣0 - 楓幣 1 - 樂豆點 2 - 楓葉點數(不足樂豆扣) 3 - 里程 道具ID - 道具], [租用需求MVP等級]
    [1202193, 3000, 2, 0], // 輪迴碑石
    [1114401, 100000000, 0, 1], // 苦行的戒指
    [1114400, 300000000, 0, 1], // 燃燒之戒
    [1114402, 350000000, 0, 1] // 艾爾達斯的祝福戒指
];
// MVP裝-租用需求等級不得低於5(即銀牌), 否則會出問題
var mvpEquip = [
    [1114400, 500, 2, 5], // MVP燃燒之戒
    [1114402, 800, 2, 5], // MVP艾爾達斯的祝福戒指
    [1202193, 5000, 2, 5], // MVP輪迴碑石
    [1033000, 1000, 1, 6] // MVP露希妲耳環
];

/* MVP裝合成設定 */
/*
 * ItemID MVP裝道具ID
 * Currency 貨幣(0 - 楓幣 1 - 樂豆點 2 - 楓葉點數[不足樂豆扣] 3 - 里程 道具ID - 道具)
 * Amount 價格
 */
var MvpEqpArr = {
    0:{
        // 輪迴碑石
        ItemID:1202193,
        Currency:1202193,
        Amount:10
    },
    1:{
        // 燃燒之戒
        ItemID:1114400,
        Currency:1114400,
        Amount:8
    },
    2:{
        // 露希妲耳環
        ItemID:1033000,
        Currency:1033000,
        Amount:5
    },
    3:{
        // 艾爾達斯的祝福戒指
        ItemID:1114402,
        Currency:1114402,
        Amount:5
    }
};


/* 強化MVP裝備設定 */
// 可強化的道具
var enhanceItem = Array(
    1114400, // 燃燒之戒
    1202193, // 輪迴碑石
    1033000, // 露希妲耳環
    1114402 // 艾爾達斯的祝福戒指
);
// 強化功能使用權限需求的MVP等級
var needMvpLevel = 0;
// 強化使用的貨幣 0 - 楓幣 1 - 樂豆點 2 - 楓葉點數(不足樂豆扣) 3 - 里程 道具ID - 道具
var priceType = 1;
// 強化需要消耗的貨幣
var enhanceCost = Array(5, 5, 5, 5, 5, 5, 5, 5, 5, 300, 20, 20, 20, 20, 200, 30, 30, 30, 30, 150, 35, 35, 35, 35, 100);
// 強化概率(1=0.001%)
var enhanceRate = Array(95000, 90000, 85000, 80000, 75000, 70000, 70000, 70000, 70000, 65000, 60000, 55000, 50000, 45000, 40000, 35000, 30000, 25000, 20000, 15000, 10000, 5000, 3000, 3000, 3000);