
  var 常用道具 = {

    紫色蘋果: 2022179,
    霞光硬幣: 4319911,
    霞光谷鑽石: 4319901,
    霞光谷錢袋: 4319903,

    潛能之鎖: 4132001,
    經驗綿羊牧場卷: 4319914,

    時裝自選潛能硬幣: 4319921,
    時裝高級潛能硬幣: 4319922,
    時裝潛能硬幣: 4319923,

    恢復卡: 5064400,
    特殊名譽勳章: 2433808,

    輪迴星力: 4319931,
    幽暗星力: 4319932,
    燃燒星力: 4319933,

    黃金蘋果: 5060048,
    魔法豎琴: 5060025,
    艾比米修斯箱子: 5060029,
    潘朵拉箱子: 5060028,
    幸運的寶箱: 5060057,
    萌獸卡牌包: 5537000,

    覺醒的輪迴星火: 2048761,
    永遠的輪迴星火: 2048717,
    強力的輪迴星火: 2048716,
    混沌傳播者: 2702003,

    閃炫方塊: 5062020,
    閃耀方塊: 5062017,
    結合方塊: 5062026,
    附加方塊: 5062500,
    大師附加方塊: 5062501,
    萌獸方塊: 5743003,
    黃金鐵鎚: 2470003,
    白金槌子: 2472001,
    寵物強化箱: 5192000,
    
    祕法1個: 2438141,
    祕法10個: 2631906,

    真實1個: 2439992,

    P寵箱: 2430471,
    傳說卷軸: 2049786,
    RED卷箱: 2430986,
    X卷箱: 2430984,
    V卷箱: 2430985,
    B卷箱: 2430989,
    榮耀卷箱: 2430675,
    神奇卷軸箱: 2430755, //宿命、不滅
    颱風卷軸箱: 2431048, //RED、極電

    全日經驗加倍:5210000,
    全日掉寶加倍:5360015,
    藍色加倍: 2450064,
    商城加倍200: 5680647,
    商城加倍225: 5680648,
    商城加倍250: 5680649,
    經驗3倍: 2450155,

    MVP天氣: 5121104,


    溫莉鑄幣: 4001209,

    稀有潛能卷:2049700,
    
    核心寶石:2435719,
    經驗核心寶石:2439279,

    星力15強化卷: 2049372,
    星力17強化卷: 2049371,
    星力18強化卷: 2049387,
    星力19強化卷: 2049388,
    星力20強化卷: 2049376,
    追加1星30: 2644006,
    追加1星50: 2644007,
    追加1星100: 2644008,

    不穩定進化晶片: 4319941,
    進化晶片: 4319942,
    進化晶片選擇卷: 2439993,

    克伯威水滴石: 4001890,
    太初水滴石: 4001889,
    蝴蝶翅膀水滴石: 4001879,
    奧術之河水滴石: 4001878,

    字型自選箱: 2435604,
    騎寵自選箱: 2633064,
    椅子自選箱: 2431256

};