/*自由轉職*///夜海撰寫

var status = -1;
var 目前職業;
var 目前職業分類;
var 目標職業;
var 是否是可轉職職業;
var 轉職需求硬幣 = 4310227;
var 轉職需求硬幣數量 = 1;
var jobData = new Array(
    [1,112,"英雄"],
    [1,122,"聖騎士"],
    [1,132,"黑騎士"],
    [1,1112,"靈魂大師"],
    [1,3712,"爆拳槍神"],
    [1,3112,"惡魔殺手"],
    [1,3122,"惡魔復仇者"],
    [1,2112,"狂狼勇士"],
    [1,4112,"劍豪"],
    [1,5112,"米哈逸"],
    [1,6112,"凱薩"],
    [1,15112,"阿戴爾"],
    
    [2,312,"箭神"],
    [2,322,"神射手"],
    [2,332,"開拓者"],
    [2,1312,"破風使者"],
    [2,3312,"狂豹獵人"],
    [2,2312,"精靈遊俠"],
    [2,6312,"凱殷"],
    
    [3,3212,"煉獄巫師"],
    [3,212,"火毒大魔導"],
    [3,222,"冰雷大魔導"],
    [3,232,"神聖大魔導"],
    [3,1212,"最頂級火牢術魔法"],
    [3,2218,"龍魔導士"],
    [3,2712,"夜光"],
    [3,4212,"陰陽師"],
    [3,14212,"凱內西斯"],
    [3,15212,"伊利恩"],

    [4,412,"夜使者"],
    [4,422,"暗影神偷"],
    [4,434,"影武者"],
    [4,1412,"暗夜行者的秘笈"],
    [4,2412,"幻影俠盜"],
    [4,6412,"卡蒂娜"],
    [4,16412,"虎影"],

    [5,512,"拳霸"],
    [5,522,"槍神"],
    [5,532,"重砲指揮官"],
    [5,1512,"反叛者的完成"],
    [5,3512,"機甲戰神"],
    [5,2512,"隱月"],
    [5,15512,"亞克"],
	[5,6512,"天使破壞者"],
	[5,17512,"墨玄"]
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        目前職業 = cm.getJob();
        是否是可轉職職業 = false;
        for(var i=0;i<jobData.length;i++){
            if( 目前職業==jobData[i][1]){
                是否是可轉職職業 = true;
                目前職業分類 = jobData[i][0];
                break;
            }
        }
        if(!是否是可轉職職業){
            cm.sendOk("您的職業不能自由轉職喔! \r\n目前職業代碼: " + cm.getJob());
            cm.dispose();
            return;
        }
        
        var str = "";
        for(var i=0;i<jobData.length;i++){
                str += "#L"+jobData[i][1]+"#轉職成為 #b"+jobData[i][2]+"#k#l\r\n";
        }        
        cm.sendSimple(str);
    } else if (status == 1) {
        目標職業 = selection;
        /*if(!cm.haveItem(轉職需求硬幣,轉職需求硬幣數量)){
            cm.sendOk("您的轉職硬幣不夠喔!");
            cm.dispose();
            return;
        }
        
        //扣除硬幣
        cm.gainItem(轉職需求硬幣,-轉職需求硬幣數量);*/
       //開始自由轉職
        cm.getPlayer().changeJob(目標職業);
        //清理技能
        cm.clearSkills();
        cm.dispose();
        return;
        
    } 
}